Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GPT12_Incremental_Encoder_1/Libraries/Infra/Sfr/TC38x/IfxSrc_reg.h
/** \brief 4D0, DMA Channel  88 Service Request */
#define SRC_DMA_DMA0_CH88 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384D0u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH88.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH88.
*/
#define SRC_DMACH88 (SRC_DMA_DMA0_CH88)

/** \brief 4D4, DMA Channel  89 Service Request */
#define SRC_DMA_DMA0_CH89 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384D4u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH89.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH89.
*/
#define SRC_DMACH89 (SRC_DMA_DMA0_CH89)

/** \brief 4D8, DMA Channel  90 Service Request */
#define SRC_DMA_DMA0_CH90 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384D8u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH90.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH90.
*/
#define SRC_DMACH90 (SRC_DMA_DMA0_CH90)

/** \brief 4DC, DMA Channel  91 Service Request */
#define SRC_DMA_DMA0_CH91 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384DCu)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH91.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH91.
*/
#define SRC_DMACH91 (SRC_DMA_DMA0_CH91)

/** \brief 4E0, DMA Channel  92 Service Request */
#define SRC_DMA_DMA0_CH92 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384E0u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH92.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH92.
*/
#define SRC_DMACH92 (SRC_DMA_DMA0_CH92)

/** \brief 4E4, DMA Channel  93 Service Request */
#define SRC_DMA_DMA0_CH93 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384E4u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH93.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH93.
*/
#define SRC_DMACH93 (SRC_DMA_DMA0_CH93)

/** \brief 4E8, DMA Channel  94 Service Request */
#define SRC_DMA_DMA0_CH94 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384E8u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH94.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH94.
*/
#define SRC_DMACH94 (SRC_DMA_DMA0_CH94)

/** \brief 4EC, DMA Channel  95 Service Request */
#define SRC_DMA_DMA0_CH95 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384ECu)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH95.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH95.
*/
#define SRC_DMACH95 (SRC_DMA_DMA0_CH95)

/** \brief 4F0, DMA Channel  96 Service Request */
#define SRC_DMA_DMA0_CH96 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384F0u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH96.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH96.
*/
#define SRC_DMACH96 (SRC_DMA_DMA0_CH96)

/** \brief 4F4, DMA Channel  97 Service Request */
#define SRC_DMA_DMA0_CH97 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384F4u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH97.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH97.
*/
#define SRC_DMACH97 (SRC_DMA_DMA0_CH97)

/** \brief 4F8, DMA Channel  98 Service Request */
#define SRC_DMA_DMA0_CH98 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384F8u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH98.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH98.
*/
#define SRC_DMACH98 (SRC_DMA_DMA0_CH98)

/** \brief 4FC, DMA Channel  99 Service Request */
#define SRC_DMA_DMA0_CH99 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384FCu)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH99.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH99.
*/
#define SRC_DMACH99 (SRC_DMA_DMA0_CH99)

/** \brief 500, DMA Channel  100 Service Request */
#define SRC_DMA_DMA0_CH100 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038500u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH100.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH100.
*/
#define SRC_DMACH100 (SRC_DMA_DMA0_CH100)

/** \brief 504, DMA Channel  101 Service Request */
#define SRC_DMA_DMA0_CH101 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038504u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH101.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH101.
*/
#define SRC_DMACH101 (SRC_DMA_DMA0_CH101)

/** \brief 508, DMA Channel  102 Service Request */
#define SRC_DMA_DMA0_CH102 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038508u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH102.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH102.
*/
#define SRC_DMACH102 (SRC_DMA_DMA0_CH102)

/** \brief 50C, DMA Channel  103 Service Request */
#define SRC_DMA_DMA0_CH103 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003850Cu)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH103.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH103.
*/
#define SRC_DMACH103 (SRC_DMA_DMA0_CH103)

/** \brief 510, DMA Channel  104 Service Request */
#define SRC_DMA_DMA0_CH104 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038510u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH104.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH104.
*/
#define SRC_DMACH104 (SRC_DMA_DMA0_CH104)

/** \brief 514, DMA Channel  105 Service Request */
#define SRC_DMA_DMA0_CH105 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038514u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH105.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH105.
*/
#define SRC_DMACH105 (SRC_DMA_DMA0_CH105)

/** \brief 518, DMA Channel  106 Service Request */
#define SRC_DMA_DMA0_CH106 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038518u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH106.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH106.
*/
#define SRC_DMACH106 (SRC_DMA_DMA0_CH106)

/** \brief 51C, DMA Channel  107 Service Request */
#define SRC_DMA_DMA0_CH107 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003851Cu)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH107.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH107.
*/
#define SRC_DMACH107 (SRC_DMA_DMA0_CH107)

/** \brief 520, DMA Channel  108 Service Request */
#define SRC_DMA_DMA0_CH108 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038520u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH108.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH108.
*/
#define SRC_DMACH108 (SRC_DMA_DMA0_CH108)

/** \brief 524, DMA Channel  109 Service Request */
#define SRC_DMA_DMA0_CH109 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038524u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH109.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH109.
*/
#define SRC_DMACH109 (SRC_DMA_DMA0_CH109)

