Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GPT12_Incremental_Encoder_1/Libraries/Infra/Sfr/TC38x/IfxSrc_reg.h
/** \brief 780, DSADC SRM2 Service Request */
#define SRC_DSADC_DSADC2_SRM /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038780u)
/** Alias (User Manual Name) for SRC_DSADC_DSADC2_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC2_SRM.
*/
#define SRC_DSADCSRM2 (SRC_DSADC_DSADC2_SRM)

/** \brief 784, DSADC SRA2 Service Request */
#define SRC_DSADC_DSADC2_SRA /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038784u)
/** Alias (User Manual Name) for SRC_DSADC_DSADC2_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC2_SRA.
*/
#define SRC_DSADCSRA2 (SRC_DSADC_DSADC2_SRA)

/** \brief 788, DSADC SRM3 Service Request */
#define SRC_DSADC_DSADC3_SRM /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038788u)
/** Alias (User Manual Name) for SRC_DSADC_DSADC3_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC3_SRM.
*/
#define SRC_DSADCSRM3 (SRC_DSADC_DSADC3_SRM)

/** \brief 78C, DSADC SRA3 Service Request */
#define SRC_DSADC_DSADC3_SRA /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003878Cu)
/** Alias (User Manual Name) for SRC_DSADC_DSADC3_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC3_SRA.
*/
#define SRC_DSADCSRA3 (SRC_DSADC_DSADC3_SRA)

/** \brief 790, DSADC SRM4 Service Request */
#define SRC_DSADC_DSADC4_SRM /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038790u)
/** Alias (User Manual Name) for SRC_DSADC_DSADC4_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC4_SRM.
*/
#define SRC_DSADCSRM4 (SRC_DSADC_DSADC4_SRM)

/** \brief 794, DSADC SRA4 Service Request */
#define SRC_DSADC_DSADC4_SRA /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038794u)
/** Alias (User Manual Name) for SRC_DSADC_DSADC4_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC4_SRA.
*/
#define SRC_DSADCSRA4 (SRC_DSADC_DSADC4_SRA)

/** \brief 798, DSADC SRM5 Service Request */
#define SRC_DSADC_DSADC5_SRM /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038798u)
/** Alias (User Manual Name) for SRC_DSADC_DSADC5_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC5_SRM.
*/
#define SRC_DSADCSRM5 (SRC_DSADC_DSADC5_SRM)

/** \brief 79C, DSADC SRA5 Service Request */
#define SRC_DSADC_DSADC5_SRA /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003879Cu)
/** Alias (User Manual Name) for SRC_DSADC_DSADC5_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC5_SRA.
*/
#define SRC_DSADCSRA5 (SRC_DSADC_DSADC5_SRA)

/** \brief 7A0, DSADC SRM6 Service Request */
#define SRC_DSADC_DSADC6_SRM /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387A0u)
/** Alias (User Manual Name) for SRC_DSADC_DSADC6_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC6_SRM.
*/
#define SRC_DSADCSRM6 (SRC_DSADC_DSADC6_SRM)

/** \brief 7A4, DSADC SRA6 Service Request */
#define SRC_DSADC_DSADC6_SRA /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387A4u)
/** Alias (User Manual Name) for SRC_DSADC_DSADC6_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC6_SRA.
*/
#define SRC_DSADCSRA6 (SRC_DSADC_DSADC6_SRA)

/** \brief 7A8, DSADC SRM7 Service Request */
#define SRC_DSADC_DSADC7_SRM /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387A8u)
/** Alias (User Manual Name) for SRC_DSADC_DSADC7_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC7_SRM.
*/
#define SRC_DSADCSRM7 (SRC_DSADC_DSADC7_SRM)

/** \brief 7AC, DSADC SRA7 Service Request */
#define SRC_DSADC_DSADC7_SRA /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387ACu)
/** Alias (User Manual Name) for SRC_DSADC_DSADC7_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC7_SRA.
*/
#define SRC_DSADCSRA7 (SRC_DSADC_DSADC7_SRA)

/** \brief 7B0, DSADC SRM8 Service Request */
#define SRC_DSADC_DSADC8_SRM /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387B0u)
/** Alias (User Manual Name) for SRC_DSADC_DSADC8_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC8_SRM.
*/
#define SRC_DSADCSRM8 (SRC_DSADC_DSADC8_SRM)

/** \brief 7B4, DSADC SRA8 Service Request */
#define SRC_DSADC_DSADC8_SRA /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387B4u)
/** Alias (User Manual Name) for SRC_DSADC_DSADC8_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC8_SRA.
*/
#define SRC_DSADCSRA8 (SRC_DSADC_DSADC8_SRA)

/** \brief 7B8, DSADC SRM9 Service Request */
#define SRC_DSADC_DSADC9_SRM /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387B8u)
/** Alias (User Manual Name) for SRC_DSADC_DSADC9_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC9_SRM.
*/
#define SRC_DSADCSRM9 (SRC_DSADC_DSADC9_SRM)

/** \brief 7BC, DSADC SRA9 Service Request */
#define SRC_DSADC_DSADC9_SRA /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387BCu)
/** Alias (User Manual Name) for SRC_DSADC_DSADC9_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC9_SRA.
*/
#define SRC_DSADCSRA9 (SRC_DSADC_DSADC9_SRA)

/** \brief 7E0, ASCLIN12 Transmit Service Request */
#define SRC_ASCLIN12_TX /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387E0u)
/** Alias (User Manual Name) for SRC_ASCLIN12_TX.
* To use register names with standard convension, please use SRC_ASCLIN12_TX.
*/
#define SRC_ASCLIN12TX (SRC_ASCLIN12_TX)

/** \brief 7E4, ASCLIN12 Receive Service Request */
#define SRC_ASCLIN12_RX /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387E4u)
/** Alias (User Manual Name) for SRC_ASCLIN12_RX.
* To use register names with standard convension, please use SRC_ASCLIN12_RX.
*/
#define SRC_ASCLIN12RX (SRC_ASCLIN12_RX)

/** \brief 7E8, ASCLIN12 Error Service Request */
#define SRC_ASCLIN12_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387E8u)
/** Alias (User Manual Name) for SRC_ASCLIN12_ERR.
* To use register names with standard convension, please use SRC_ASCLIN12_ERR.
*/
#define SRC_ASCLIN12ERR (SRC_ASCLIN12_ERR)

/** \brief 7EC, ASCLIN13 Transmit Service Request */
#define SRC_ASCLIN13_TX /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387ECu)
/** Alias (User Manual Name) for SRC_ASCLIN13_TX.
* To use register names with standard convension, please use SRC_ASCLIN13_TX.
*/
#define SRC_ASCLIN13TX (SRC_ASCLIN13_TX)

/** \brief 7F0, ASCLIN13 Receive Service Request */
#define SRC_ASCLIN13_RX /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387F0u)
/** Alias (User Manual Name) for SRC_ASCLIN13_RX.
* To use register names with standard convension, please use SRC_ASCLIN13_RX.
*/
#define SRC_ASCLIN13RX (SRC_ASCLIN13_RX)

