Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GPT12_Incremental_Encoder_1/Libraries/Infra/Sfr/TC38x/IfxSrc_reg.h
/** \brief AB0, PSM0 Shared Service Request 4 */
#define SRC_GTM_PSM0_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AB0u)
/** Alias (User Manual Name) for SRC_GTM_PSM0_4.
* To use register names with standard convension, please use SRC_GTM_PSM0_4.
*/
#define SRC_GTMPSM04 (SRC_GTM_PSM0_4)

/** \brief AB4, PSM0 Shared Service Request 5 */
#define SRC_GTM_PSM0_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AB4u)
/** Alias (User Manual Name) for SRC_GTM_PSM0_5.
* To use register names with standard convension, please use SRC_GTM_PSM0_5.
*/
#define SRC_GTMPSM05 (SRC_GTM_PSM0_5)

/** \brief AB8, PSM0 Shared Service Request 6 */
#define SRC_GTM_PSM0_6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AB8u)
/** Alias (User Manual Name) for SRC_GTM_PSM0_6.
* To use register names with standard convension, please use SRC_GTM_PSM0_6.
*/
#define SRC_GTMPSM06 (SRC_GTM_PSM0_6)

/** \brief ABC, PSM0 Shared Service Request 7 */
#define SRC_GTM_PSM0_7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038ABCu)
/** Alias (User Manual Name) for SRC_GTM_PSM0_7.
* To use register names with standard convension, please use SRC_GTM_PSM0_7.
*/
#define SRC_GTMPSM07 (SRC_GTM_PSM0_7)

/** \brief AC0, PSM1 Shared Service Request 0 */
#define SRC_GTM_PSM1_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AC0u)
/** Alias (User Manual Name) for SRC_GTM_PSM1_0.
* To use register names with standard convension, please use SRC_GTM_PSM1_0.
*/
#define SRC_GTMPSM10 (SRC_GTM_PSM1_0)

/** \brief AC4, PSM1 Shared Service Request 1 */
#define SRC_GTM_PSM1_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AC4u)
/** Alias (User Manual Name) for SRC_GTM_PSM1_1.
* To use register names with standard convension, please use SRC_GTM_PSM1_1.
*/
#define SRC_GTMPSM11 (SRC_GTM_PSM1_1)

/** \brief AC8, PSM1 Shared Service Request 2 */
#define SRC_GTM_PSM1_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AC8u)
/** Alias (User Manual Name) for SRC_GTM_PSM1_2.
* To use register names with standard convension, please use SRC_GTM_PSM1_2.
*/
#define SRC_GTMPSM12 (SRC_GTM_PSM1_2)

/** \brief ACC, PSM1 Shared Service Request 3 */
#define SRC_GTM_PSM1_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038ACCu)
/** Alias (User Manual Name) for SRC_GTM_PSM1_3.
* To use register names with standard convension, please use SRC_GTM_PSM1_3.
*/
#define SRC_GTMPSM13 (SRC_GTM_PSM1_3)

/** \brief AD0, PSM1 Shared Service Request 4 */
#define SRC_GTM_PSM1_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AD0u)
/** Alias (User Manual Name) for SRC_GTM_PSM1_4.
* To use register names with standard convension, please use SRC_GTM_PSM1_4.
*/
#define SRC_GTMPSM14 (SRC_GTM_PSM1_4)

/** \brief AD4, PSM1 Shared Service Request 5 */
#define SRC_GTM_PSM1_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AD4u)
/** Alias (User Manual Name) for SRC_GTM_PSM1_5.
* To use register names with standard convension, please use SRC_GTM_PSM1_5.
*/
#define SRC_GTMPSM15 (SRC_GTM_PSM1_5)

/** \brief AD8, PSM1 Shared Service Request 6 */
#define SRC_GTM_PSM1_6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AD8u)
/** Alias (User Manual Name) for SRC_GTM_PSM1_6.
* To use register names with standard convension, please use SRC_GTM_PSM1_6.
*/
#define SRC_GTMPSM16 (SRC_GTM_PSM1_6)

/** \brief ADC, PSM1 Shared Service Request 7 */
#define SRC_GTM_PSM1_7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038ADCu)
/** Alias (User Manual Name) for SRC_GTM_PSM1_7.
* To use register names with standard convension, please use SRC_GTM_PSM1_7.
*/
#define SRC_GTMPSM17 (SRC_GTM_PSM1_7)

/** \brief B00, DPLL Service Request 0 */
#define SRC_GTM_DPLL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B00u)
/** Alias (User Manual Name) for SRC_GTM_DPLL0.
* To use register names with standard convension, please use SRC_GTM_DPLL0.
*/
#define SRC_GTMDPLL0 (SRC_GTM_DPLL0)

/** \brief B04, DPLL Service Request 1 */
#define SRC_GTM_DPLL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B04u)
/** Alias (User Manual Name) for SRC_GTM_DPLL1.
* To use register names with standard convension, please use SRC_GTM_DPLL1.
*/
#define SRC_GTMDPLL1 (SRC_GTM_DPLL1)

/** \brief B08, DPLL Service Request 2 */
#define SRC_GTM_DPLL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B08u)
/** Alias (User Manual Name) for SRC_GTM_DPLL2.
* To use register names with standard convension, please use SRC_GTM_DPLL2.
*/
#define SRC_GTMDPLL2 (SRC_GTM_DPLL2)

/** \brief B0C, DPLL Service Request 3 */
#define SRC_GTM_DPLL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B0Cu)
/** Alias (User Manual Name) for SRC_GTM_DPLL3.
* To use register names with standard convension, please use SRC_GTM_DPLL3.
*/
#define SRC_GTMDPLL3 (SRC_GTM_DPLL3)

/** \brief B10, DPLL Service Request 4 */
#define SRC_GTM_DPLL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B10u)
/** Alias (User Manual Name) for SRC_GTM_DPLL4.
* To use register names with standard convension, please use SRC_GTM_DPLL4.
*/
#define SRC_GTMDPLL4 (SRC_GTM_DPLL4)

/** \brief B14, DPLL Service Request 5 */
#define SRC_GTM_DPLL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B14u)
/** Alias (User Manual Name) for SRC_GTM_DPLL5.
* To use register names with standard convension, please use SRC_GTM_DPLL5.
*/
#define SRC_GTMDPLL5 (SRC_GTM_DPLL5)

/** \brief B18, DPLL Service Request 6 */
#define SRC_GTM_DPLL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B18u)
/** Alias (User Manual Name) for SRC_GTM_DPLL6.
* To use register names with standard convension, please use SRC_GTM_DPLL6.
*/
#define SRC_GTMDPLL6 (SRC_GTM_DPLL6)

/** \brief B1C, DPLL Service Request 7 */
#define SRC_GTM_DPLL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B1Cu)
/** Alias (User Manual Name) for SRC_GTM_DPLL7.
* To use register names with standard convension, please use SRC_GTM_DPLL7.
*/
#define SRC_GTMDPLL7 (SRC_GTM_DPLL7)

/** \brief B20, DPLL Service Request 8 */
#define SRC_GTM_DPLL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B20u)
/** Alias (User Manual Name) for SRC_GTM_DPLL8.
* To use register names with standard convension, please use SRC_GTM_DPLL8.
*/
#define SRC_GTMDPLL8 (SRC_GTM_DPLL8)

/** \brief B24, DPLL Service Request 9 */
#define SRC_GTM_DPLL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B24u)
/** Alias (User Manual Name) for SRC_GTM_DPLL9.
* To use register names with standard convension, please use SRC_GTM_DPLL9.
*/
#define SRC_GTMDPLL9 (SRC_GTM_DPLL9)

/** \brief B28, DPLL Service Request 10 */
#define SRC_GTM_DPLL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B28u)
/** Alias (User Manual Name) for SRC_GTM_DPLL10.
* To use register names with standard convension, please use SRC_GTM_DPLL10.
*/
#define SRC_GTMDPLL10 (SRC_GTM_DPLL10)

/** \brief B2C, DPLL Service Request 11 */
#define SRC_GTM_DPLL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B2Cu)
/** Alias (User Manual Name) for SRC_GTM_DPLL11.
* To use register names with standard convension, please use SRC_GTM_DPLL11.
*/
#define SRC_GTMDPLL11 (SRC_GTM_DPLL11)

