Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GPT12_Incremental_Encoder_1/Libraries/Infra/Sfr/TC38x/IfxSrc_reg.h
/** \brief C04, TIM3 Shared Service Request 5 */
#define SRC_GTM_TIM3_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C04u)
/** Alias (User Manual Name) for SRC_GTM_TIM3_5.
* To use register names with standard convension, please use SRC_GTM_TIM3_5.
*/
#define SRC_GTMTIM35 (SRC_GTM_TIM3_5)

/** \brief C08, TIM3 Shared Service Request 6 */
#define SRC_GTM_TIM3_6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C08u)
/** Alias (User Manual Name) for SRC_GTM_TIM3_6.
* To use register names with standard convension, please use SRC_GTM_TIM3_6.
*/
#define SRC_GTMTIM36 (SRC_GTM_TIM3_6)

/** \brief C0C, TIM3 Shared Service Request 7 */
#define SRC_GTM_TIM3_7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C0Cu)
/** Alias (User Manual Name) for SRC_GTM_TIM3_7.
* To use register names with standard convension, please use SRC_GTM_TIM3_7.
*/
#define SRC_GTMTIM37 (SRC_GTM_TIM3_7)

/** \brief C10, TIM4 Shared Service Request 0 */
#define SRC_GTM_TIM4_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C10u)
/** Alias (User Manual Name) for SRC_GTM_TIM4_0.
* To use register names with standard convension, please use SRC_GTM_TIM4_0.
*/
#define SRC_GTMTIM40 (SRC_GTM_TIM4_0)

/** \brief C14, TIM4 Shared Service Request 1 */
#define SRC_GTM_TIM4_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C14u)
/** Alias (User Manual Name) for SRC_GTM_TIM4_1.
* To use register names with standard convension, please use SRC_GTM_TIM4_1.
*/
#define SRC_GTMTIM41 (SRC_GTM_TIM4_1)

/** \brief C18, TIM4 Shared Service Request 2 */
#define SRC_GTM_TIM4_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C18u)
/** Alias (User Manual Name) for SRC_GTM_TIM4_2.
* To use register names with standard convension, please use SRC_GTM_TIM4_2.
*/
#define SRC_GTMTIM42 (SRC_GTM_TIM4_2)

/** \brief C1C, TIM4 Shared Service Request 3 */
#define SRC_GTM_TIM4_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C1Cu)
/** Alias (User Manual Name) for SRC_GTM_TIM4_3.
* To use register names with standard convension, please use SRC_GTM_TIM4_3.
*/
#define SRC_GTMTIM43 (SRC_GTM_TIM4_3)

/** \brief C20, TIM4 Shared Service Request 4 */
#define SRC_GTM_TIM4_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C20u)
/** Alias (User Manual Name) for SRC_GTM_TIM4_4.
* To use register names with standard convension, please use SRC_GTM_TIM4_4.
*/
#define SRC_GTMTIM44 (SRC_GTM_TIM4_4)

/** \brief C24, TIM4 Shared Service Request 5 */
#define SRC_GTM_TIM4_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C24u)
/** Alias (User Manual Name) for SRC_GTM_TIM4_5.
* To use register names with standard convension, please use SRC_GTM_TIM4_5.
*/
#define SRC_GTMTIM45 (SRC_GTM_TIM4_5)

/** \brief C28, TIM4 Shared Service Request 6 */
#define SRC_GTM_TIM4_6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C28u)
/** Alias (User Manual Name) for SRC_GTM_TIM4_6.
* To use register names with standard convension, please use SRC_GTM_TIM4_6.
*/
#define SRC_GTMTIM46 (SRC_GTM_TIM4_6)

/** \brief C2C, TIM4 Shared Service Request 7 */
#define SRC_GTM_TIM4_7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C2Cu)
/** Alias (User Manual Name) for SRC_GTM_TIM4_7.
* To use register names with standard convension, please use SRC_GTM_TIM4_7.
*/
#define SRC_GTMTIM47 (SRC_GTM_TIM4_7)

/** \brief C30, TIM5 Shared Service Request 0 */
#define SRC_GTM_TIM5_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C30u)
/** Alias (User Manual Name) for SRC_GTM_TIM5_0.
* To use register names with standard convension, please use SRC_GTM_TIM5_0.
*/
#define SRC_GTMTIM50 (SRC_GTM_TIM5_0)

/** \brief C34, TIM5 Shared Service Request 1 */
#define SRC_GTM_TIM5_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C34u)
/** Alias (User Manual Name) for SRC_GTM_TIM5_1.
* To use register names with standard convension, please use SRC_GTM_TIM5_1.
*/
#define SRC_GTMTIM51 (SRC_GTM_TIM5_1)

/** \brief C38, TIM5 Shared Service Request 2 */
#define SRC_GTM_TIM5_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C38u)
/** Alias (User Manual Name) for SRC_GTM_TIM5_2.
* To use register names with standard convension, please use SRC_GTM_TIM5_2.
*/
#define SRC_GTMTIM52 (SRC_GTM_TIM5_2)

/** \brief C3C, TIM5 Shared Service Request 3 */
#define SRC_GTM_TIM5_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C3Cu)
/** Alias (User Manual Name) for SRC_GTM_TIM5_3.
* To use register names with standard convension, please use SRC_GTM_TIM5_3.
*/
#define SRC_GTMTIM53 (SRC_GTM_TIM5_3)

/** \brief C40, TIM5 Shared Service Request 4 */
#define SRC_GTM_TIM5_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C40u)
/** Alias (User Manual Name) for SRC_GTM_TIM5_4.
* To use register names with standard convension, please use SRC_GTM_TIM5_4.
*/
#define SRC_GTMTIM54 (SRC_GTM_TIM5_4)

/** \brief C44, TIM5 Shared Service Request 5 */
#define SRC_GTM_TIM5_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C44u)
/** Alias (User Manual Name) for SRC_GTM_TIM5_5.
* To use register names with standard convension, please use SRC_GTM_TIM5_5.
*/
#define SRC_GTMTIM55 (SRC_GTM_TIM5_5)

/** \brief C48, TIM5 Shared Service Request 6 */
#define SRC_GTM_TIM5_6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C48u)
/** Alias (User Manual Name) for SRC_GTM_TIM5_6.
* To use register names with standard convension, please use SRC_GTM_TIM5_6.
*/
#define SRC_GTMTIM56 (SRC_GTM_TIM5_6)

/** \brief C4C, TIM5 Shared Service Request 7 */
#define SRC_GTM_TIM5_7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C4Cu)
/** Alias (User Manual Name) for SRC_GTM_TIM5_7.
* To use register names with standard convension, please use SRC_GTM_TIM5_7.
*/
#define SRC_GTMTIM57 (SRC_GTM_TIM5_7)

/** \brief C50, TIM6 Shared Service Request 0 */
#define SRC_GTM_TIM6_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C50u)
/** Alias (User Manual Name) for SRC_GTM_TIM6_0.
* To use register names with standard convension, please use SRC_GTM_TIM6_0.
*/
#define SRC_GTMTIM60 (SRC_GTM_TIM6_0)

