Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GPT12_Incremental_Encoder_1/Libraries/Infra/Sfr/TC38x/IfxSrc_reg.h
/** \brief CD8, MCS1 Shared Service Request 2 */
#define SRC_GTM_MCS1_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038CD8u)
/** Alias (User Manual Name) for SRC_GTM_MCS1_2.
* To use register names with standard convension, please use SRC_GTM_MCS1_2.
*/
#define SRC_GTMMCS12 (SRC_GTM_MCS1_2)

/** \brief CDC, MCS1 Shared Service Request 3 */
#define SRC_GTM_MCS1_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038CDCu)
/** Alias (User Manual Name) for SRC_GTM_MCS1_3.
* To use register names with standard convension, please use SRC_GTM_MCS1_3.
*/
#define SRC_GTMMCS13 (SRC_GTM_MCS1_3)

/** \brief CE0, MCS1 Shared Service Request 4 */
#define SRC_GTM_MCS1_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038CE0u)
/** Alias (User Manual Name) for SRC_GTM_MCS1_4.
* To use register names with standard convension, please use SRC_GTM_MCS1_4.
*/
#define SRC_GTMMCS14 (SRC_GTM_MCS1_4)

/** \brief CE4, MCS1 Shared Service Request 5 */
#define SRC_GTM_MCS1_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038CE4u)
/** Alias (User Manual Name) for SRC_GTM_MCS1_5.
* To use register names with standard convension, please use SRC_GTM_MCS1_5.
*/
#define SRC_GTMMCS15 (SRC_GTM_MCS1_5)

/** \brief CE8, MCS1 Shared Service Request 6 */
#define SRC_GTM_MCS1_6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038CE8u)
/** Alias (User Manual Name) for SRC_GTM_MCS1_6.
* To use register names with standard convension, please use SRC_GTM_MCS1_6.
*/
#define SRC_GTMMCS16 (SRC_GTM_MCS1_6)

/** \brief CEC, MCS1 Shared Service Request 7 */
#define SRC_GTM_MCS1_7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038CECu)
/** Alias (User Manual Name) for SRC_GTM_MCS1_7.
* To use register names with standard convension, please use SRC_GTM_MCS1_7.
*/
#define SRC_GTMMCS17 (SRC_GTM_MCS1_7)

/** \brief CF0, MCS2 Shared Service Request 0 */
#define SRC_GTM_MCS2_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038CF0u)
/** Alias (User Manual Name) for SRC_GTM_MCS2_0.
* To use register names with standard convension, please use SRC_GTM_MCS2_0.
*/
#define SRC_GTMMCS20 (SRC_GTM_MCS2_0)

/** \brief CF4, MCS2 Shared Service Request 1 */
#define SRC_GTM_MCS2_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038CF4u)
/** Alias (User Manual Name) for SRC_GTM_MCS2_1.
* To use register names with standard convension, please use SRC_GTM_MCS2_1.
*/
#define SRC_GTMMCS21 (SRC_GTM_MCS2_1)

/** \brief CF8, MCS2 Shared Service Request 2 */
#define SRC_GTM_MCS2_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038CF8u)
/** Alias (User Manual Name) for SRC_GTM_MCS2_2.
* To use register names with standard convension, please use SRC_GTM_MCS2_2.
*/
#define SRC_GTMMCS22 (SRC_GTM_MCS2_2)

/** \brief CFC, MCS2 Shared Service Request 3 */
#define SRC_GTM_MCS2_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038CFCu)
/** Alias (User Manual Name) for SRC_GTM_MCS2_3.
* To use register names with standard convension, please use SRC_GTM_MCS2_3.
*/
#define SRC_GTMMCS23 (SRC_GTM_MCS2_3)

/** \brief D00, MCS2 Shared Service Request 4 */
#define SRC_GTM_MCS2_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D00u)
/** Alias (User Manual Name) for SRC_GTM_MCS2_4.
* To use register names with standard convension, please use SRC_GTM_MCS2_4.
*/
#define SRC_GTMMCS24 (SRC_GTM_MCS2_4)

/** \brief D04, MCS2 Shared Service Request 5 */
#define SRC_GTM_MCS2_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D04u)
/** Alias (User Manual Name) for SRC_GTM_MCS2_5.
* To use register names with standard convension, please use SRC_GTM_MCS2_5.
*/
#define SRC_GTMMCS25 (SRC_GTM_MCS2_5)

/** \brief D08, MCS2 Shared Service Request 6 */
#define SRC_GTM_MCS2_6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D08u)
/** Alias (User Manual Name) for SRC_GTM_MCS2_6.
* To use register names with standard convension, please use SRC_GTM_MCS2_6.
*/
#define SRC_GTMMCS26 (SRC_GTM_MCS2_6)

/** \brief D0C, MCS2 Shared Service Request 7 */
#define SRC_GTM_MCS2_7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D0Cu)
/** Alias (User Manual Name) for SRC_GTM_MCS2_7.
* To use register names with standard convension, please use SRC_GTM_MCS2_7.
*/
#define SRC_GTMMCS27 (SRC_GTM_MCS2_7)

/** \brief D10, MCS3 Shared Service Request 0 */
#define SRC_GTM_MCS3_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D10u)
/** Alias (User Manual Name) for SRC_GTM_MCS3_0.
* To use register names with standard convension, please use SRC_GTM_MCS3_0.
*/
#define SRC_GTMMCS30 (SRC_GTM_MCS3_0)

/** \brief D14, MCS3 Shared Service Request 1 */
#define SRC_GTM_MCS3_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D14u)
/** Alias (User Manual Name) for SRC_GTM_MCS3_1.
* To use register names with standard convension, please use SRC_GTM_MCS3_1.
*/
#define SRC_GTMMCS31 (SRC_GTM_MCS3_1)

/** \brief D18, MCS3 Shared Service Request 2 */
#define SRC_GTM_MCS3_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D18u)
/** Alias (User Manual Name) for SRC_GTM_MCS3_2.
* To use register names with standard convension, please use SRC_GTM_MCS3_2.
*/
#define SRC_GTMMCS32 (SRC_GTM_MCS3_2)

/** \brief D1C, MCS3 Shared Service Request 3 */
#define SRC_GTM_MCS3_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D1Cu)
/** Alias (User Manual Name) for SRC_GTM_MCS3_3.
* To use register names with standard convension, please use SRC_GTM_MCS3_3.
*/
#define SRC_GTMMCS33 (SRC_GTM_MCS3_3)

/** \brief D20, MCS3 Shared Service Request 4 */
#define SRC_GTM_MCS3_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D20u)
/** Alias (User Manual Name) for SRC_GTM_MCS3_4.
* To use register names with standard convension, please use SRC_GTM_MCS3_4.
*/
#define SRC_GTMMCS34 (SRC_GTM_MCS3_4)

/** \brief D24, MCS3 Shared Service Request 5 */
#define SRC_GTM_MCS3_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D24u)
/** Alias (User Manual Name) for SRC_GTM_MCS3_5.
* To use register names with standard convension, please use SRC_GTM_MCS3_5.
*/
#define SRC_GTMMCS35 (SRC_GTM_MCS3_5)

/** \brief D28, MCS3 Shared Service Request 6 */
#define SRC_GTM_MCS3_6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D28u)
/** Alias (User Manual Name) for SRC_GTM_MCS3_6.
* To use register names with standard convension, please use SRC_GTM_MCS3_6.
*/
#define SRC_GTMMCS36 (SRC_GTM_MCS3_6)

/** \brief D2C, MCS3 Shared Service Request 7 */
#define SRC_GTM_MCS3_7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D2Cu)
/** Alias (User Manual Name) for SRC_GTM_MCS3_7.
* To use register names with standard convension, please use SRC_GTM_MCS3_7.
*/
#define SRC_GTMMCS37 (SRC_GTM_MCS3_7)

/** \brief D30, MCS4 Shared Service Request 0 */
#define SRC_GTM_MCS4_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D30u)
/** Alias (User Manual Name) for SRC_GTM_MCS4_0.
* To use register names with standard convension, please use SRC_GTM_MCS4_0.
*/
#define SRC_GTMMCS40 (SRC_GTM_MCS4_0)

/** \brief D34, MCS4 Shared Service Request 1 */
#define SRC_GTM_MCS4_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D34u)
/** Alias (User Manual Name) for SRC_GTM_MCS4_1.
* To use register names with standard convension, please use SRC_GTM_MCS4_1.
*/
#define SRC_GTMMCS41 (SRC_GTM_MCS4_1)

