Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GPT12_Incremental_Encoder_1/Libraries/Infra/Sfr/TC38x/IfxSrc_reg.h
/** \brief E74, TOM3 Shared Service Request 1 */
#define SRC_GTM_TOM3_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E74u)
/** Alias (User Manual Name) for SRC_GTM_TOM3_1.
* To use register names with standard convension, please use SRC_GTM_TOM3_1.
*/
#define SRC_GTMTOM31 (SRC_GTM_TOM3_1)

/** \brief E78, TOM3 Shared Service Request 2 */
#define SRC_GTM_TOM3_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E78u)
/** Alias (User Manual Name) for SRC_GTM_TOM3_2.
* To use register names with standard convension, please use SRC_GTM_TOM3_2.
*/
#define SRC_GTMTOM32 (SRC_GTM_TOM3_2)

/** \brief E7C, TOM3 Shared Service Request 3 */
#define SRC_GTM_TOM3_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E7Cu)
/** Alias (User Manual Name) for SRC_GTM_TOM3_3.
* To use register names with standard convension, please use SRC_GTM_TOM3_3.
*/
#define SRC_GTMTOM33 (SRC_GTM_TOM3_3)

/** \brief E80, TOM3 Shared Service Request 4 */
#define SRC_GTM_TOM3_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E80u)
/** Alias (User Manual Name) for SRC_GTM_TOM3_4.
* To use register names with standard convension, please use SRC_GTM_TOM3_4.
*/
#define SRC_GTMTOM34 (SRC_GTM_TOM3_4)

/** \brief E84, TOM3 Shared Service Request 5 */
#define SRC_GTM_TOM3_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E84u)
/** Alias (User Manual Name) for SRC_GTM_TOM3_5.
* To use register names with standard convension, please use SRC_GTM_TOM3_5.
*/
#define SRC_GTMTOM35 (SRC_GTM_TOM3_5)

/** \brief E88, TOM3 Shared Service Request 6 */
#define SRC_GTM_TOM3_6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E88u)
/** Alias (User Manual Name) for SRC_GTM_TOM3_6.
* To use register names with standard convension, please use SRC_GTM_TOM3_6.
*/
#define SRC_GTMTOM36 (SRC_GTM_TOM3_6)

/** \brief E8C, TOM3 Shared Service Request 7 */
#define SRC_GTM_TOM3_7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E8Cu)
/** Alias (User Manual Name) for SRC_GTM_TOM3_7.
* To use register names with standard convension, please use SRC_GTM_TOM3_7.
*/
#define SRC_GTMTOM37 (SRC_GTM_TOM3_7)

/** \brief E90, TOM4 Shared Service Request 0 */
#define SRC_GTM_TOM4_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E90u)
/** Alias (User Manual Name) for SRC_GTM_TOM4_0.
* To use register names with standard convension, please use SRC_GTM_TOM4_0.
*/
#define SRC_GTMTOM40 (SRC_GTM_TOM4_0)

/** \brief E94, TOM4 Shared Service Request 1 */
#define SRC_GTM_TOM4_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E94u)
/** Alias (User Manual Name) for SRC_GTM_TOM4_1.
* To use register names with standard convension, please use SRC_GTM_TOM4_1.
*/
#define SRC_GTMTOM41 (SRC_GTM_TOM4_1)

/** \brief E98, TOM4 Shared Service Request 2 */
#define SRC_GTM_TOM4_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E98u)
/** Alias (User Manual Name) for SRC_GTM_TOM4_2.
* To use register names with standard convension, please use SRC_GTM_TOM4_2.
*/
#define SRC_GTMTOM42 (SRC_GTM_TOM4_2)

/** \brief E9C, TOM4 Shared Service Request 3 */
#define SRC_GTM_TOM4_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E9Cu)
/** Alias (User Manual Name) for SRC_GTM_TOM4_3.
* To use register names with standard convension, please use SRC_GTM_TOM4_3.
*/
#define SRC_GTMTOM43 (SRC_GTM_TOM4_3)

/** \brief EA0, TOM4 Shared Service Request 4 */
#define SRC_GTM_TOM4_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038EA0u)
/** Alias (User Manual Name) for SRC_GTM_TOM4_4.
* To use register names with standard convension, please use SRC_GTM_TOM4_4.
*/
#define SRC_GTMTOM44 (SRC_GTM_TOM4_4)

/** \brief EA4, TOM4 Shared Service Request 5 */
#define SRC_GTM_TOM4_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038EA4u)
/** Alias (User Manual Name) for SRC_GTM_TOM4_5.
* To use register names with standard convension, please use SRC_GTM_TOM4_5.
*/
#define SRC_GTMTOM45 (SRC_GTM_TOM4_5)

/** \brief EA8, TOM4 Shared Service Request 6 */
#define SRC_GTM_TOM4_6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038EA8u)
/** Alias (User Manual Name) for SRC_GTM_TOM4_6.
* To use register names with standard convension, please use SRC_GTM_TOM4_6.
*/
#define SRC_GTMTOM46 (SRC_GTM_TOM4_6)

/** \brief EAC, TOM4 Shared Service Request 7 */
#define SRC_GTM_TOM4_7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038EACu)
/** Alias (User Manual Name) for SRC_GTM_TOM4_7.
* To use register names with standard convension, please use SRC_GTM_TOM4_7.
*/
#define SRC_GTMTOM47 (SRC_GTM_TOM4_7)

/** \brief ED0, ASCLIN20 Transmit Service Request */
#define SRC_ASCLIN20_TX /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038ED0u)
/** Alias (User Manual Name) for SRC_ASCLIN20_TX.
* To use register names with standard convension, please use SRC_ASCLIN20_TX.
*/
#define SRC_ASCLIN20TX (SRC_ASCLIN20_TX)

/** \brief ED4, ASCLIN20 Receive Service Request */
#define SRC_ASCLIN20_RX /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038ED4u)
/** Alias (User Manual Name) for SRC_ASCLIN20_RX.
* To use register names with standard convension, please use SRC_ASCLIN20_RX.
*/
#define SRC_ASCLIN20RX (SRC_ASCLIN20_RX)

/** \brief ED8, ASCLIN20 Error Service Request */
#define SRC_ASCLIN20_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038ED8u)
/** Alias (User Manual Name) for SRC_ASCLIN20_ERR.
* To use register names with standard convension, please use SRC_ASCLIN20_ERR.
*/
#define SRC_ASCLIN20ERR (SRC_ASCLIN20_ERR)

/** \brief EDC, ASCLIN21 Transmit Service Request */
#define SRC_ASCLIN21_TX /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038EDCu)
/** Alias (User Manual Name) for SRC_ASCLIN21_TX.
* To use register names with standard convension, please use SRC_ASCLIN21_TX.
*/
#define SRC_ASCLIN21TX (SRC_ASCLIN21_TX)

/** \brief EE0, ASCLIN21 Receive Service Request */
#define SRC_ASCLIN21_RX /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038EE0u)
/** Alias (User Manual Name) for SRC_ASCLIN21_RX.
* To use register names with standard convension, please use SRC_ASCLIN21_RX.
*/
#define SRC_ASCLIN21RX (SRC_ASCLIN21_RX)

